"bothMasculineText" = "Ambos";
"bothFeminineText" = "Ambas";
"Browse" = "Explorar";
"Frequency" = "Frecuencia";
"Alphabetical" = "Alfabético";
"Defective" = "Defectuoso";
"Info" = "Información";
"Irreg. ☛ %@" = "Irreg. ☛ %@";
"Irregular" = "Irregular";
"Not Defective" = "No Defectuoso";
"Quiz" = "Test";
"Tense" = "Tiempo";
"Regular" = "Regular";
"Results" = "Resultados";
"Settings" = "Configuración";
"E" = "F";
"E & M" = "F y M";
"E, M, & D" = "F, M y D";
"Filter Tenses by Difficulty" = "Filtrar Tiempos por Dificultad";
"Start" = "Comenzar";
"Restart" = "Reiniciar";
"Quit" = "Abandonar";
"Game Center" = "Game Center";
"Okay" = "OK";
"Got It" = "Entiendo";
"Would you like Conjugar to upload your future scores to Game Center after your quiz? See how you stack up against the global community of conjugators." = "¿Te gustaría que Conjugar suiera tus futuras puntuaciones a Game Center después de tu test? Averigua dónde estás en comparación con la comunidad global de conjugadores.";
"Game Center authentication failed. This can happen if you cancel authentication or if your iPhone is not already signed into Game Center. Launch the Settings app, tap Game Center, sign in, and relaunch Conjugar." = "La autenticación de Game Center falló. Esto puede suceder si cancelas la autenticación o si tu iPhone aún no ha iniciado una sesión en Game Center. Inicia la aplicación Configuración, toca Game Center, inicia una sesión y relanza Conjugar.";
"No" = "No";
"Yes" = "Sí";
"Region" = "Región";
"In Latin American mode, quizzes do not include vosotros conjugations. This setting also determines how Conjugar pronounces conjugations." = "En el modo latinoamericano, los tests no incluyen las conjugaciones de vosotros. Esta configuración también influye en la forma en que Conjugar pronuncia las conjugaciones.";
"Difficulty" = "Dificultad";
"Moderate-mode quizzes test more tenses than easy-mode quizzes. Difficult-mode quizzes test more tenses than moderate-mode quizzes." = "Los tests del modo moderado examinan más tiempos verbales que los tests del modo fácil. Los tests del modo difícil examinan más tiempos verbales que los tests del modo moderado.";
"Browse Tú and/or Vos" = "Explorar Tú y/o Vos";
"This setting determines whether you see tú conjugations, vos conjugations, or both when you browse verb conjugations." = "Este ajuste determina si se muestran las conjugaciones de tú, conjugaciones de vos o ambas cuando exploras las conjugaciones verbales.";
"Quiz Tú or Vos" = "Hacer el Test de Tú o Vos";
"This setting determines whether Conjugar's quiz mode quizzes you on tú forms or vos forms of verbs." = "Esta opción determina si las preguntas del test usan las formas de tú o de vos.";
"Enable" = "Permitir";
"Conjugar can send future quiz scores to Game Center so that you can see them in the global leaderboard. Tap Enable to enable this." = "Conjugar puede enviar tus puntuaciones futuras a Game Center para que puedas verlas en la tabla de clasificación mundial (\"leaderboard\"). Toca Permitir para habilitarlo.";
"Ratings and Reviews" = "Valoraciones y Reseñas";
"Rate or Review" = "Valorar o Reseñar";
"Spain" = "España";
"Latin America" = "América Latina";
"Easy" = "Fácil";
"Moderate" = "Moderado";
"Difficult" = "Difícil";
"conjugation" = "conjugación";
"Verb" = "Verbo";
"Pronoun" = "Pronombre";
"Last Answer" = "Respuesta Anterior";
"Correct Answer" = "Respuesta Correcta";
"Score" = "Puntuación";
"Progress" = "Progreso";
"Elapsed" = "Transcurrido";
"Purpose & Use" = "Valor y Uso";
"Terminology" = "Terminología";
"Questions & Answers" = "Preguntas y Respuestas";
"Credits" = "Créditos";
"Add yours!" = "¡Añade la tuya!";
"No one has rated this version of Conjugar." = "Nadie ha valorado esta versión de Conjugar.";
"There is one rating for this version of Conjugar." = "Hay una valoración para esta versión de Conjugar.";
"There are %d ratings for this version of Conjugar." = "Hay %d valoraciones para esta versión de Conjugar.";
"Time" = "Tiempo";

"purposeAndUseText" = "^Valor^

En español, la conjugación, un concepto definido en %Terminología%, es importante por los motivos allí expuestos. Las personas criadas en países de habla hispana aprenden la conjugación mediante la escucha y el uso diario, y las personas que toman clases de español aprenden las conjugaciones como parte de su curso.

Pero existe otra categoría de estudiantes de español: gentes, como el desarrollador de ~Conjugar~, que viven en países en el que no se habla el español, que no pueden asistir a clases, pero que de una manera u otra están expuestos al español. Aquí hay un ejemplo del desafío al que se enfrentan estos estudiantes.

El desarrollador de ~Conjugar~ sabía, por haber estado expuesto al español durante un trabajo anterior, que \"ir\" significa \"to go\" y que \"ir\" tiene ciertas conjugaciones que comienzan con \"va-\". Pero saber esto no le permitió comunicarse con los hispanohablantes que se encontraba. Por ejemplo, para expresar el pensamiento \"I'm going to the office\", podría haber dicho \"ir a la oficina\" o \"va a la oficina\". Pero estas oraciones no tienen sentido para los hispanohablantes porque las conjugaciones son incorrectas. La oración correcta (y comprensible) es \"$voY$ a la oficina\".

Hay recursos excelentes para conjugar los verbos españoles. El sitio web ~SpanishDict.com~ y el libro ~Spanish Verbs Made Simple(r)~ son dos de ellos. El desarrollador de ~Conjugar~ utilizaba estos recursos cuando escribía español, pero no los tenía a mano cuando conversaba en español de manera espontánea. En algún momento, se dio cuenta de que necesitaba una forma de practicar la conjugación de verbos en español que le ayudara a que las conjugaciones correctas aparecieran en su mente cuando hablaba.

Esta fue la génesis de ~Conjugar~, la aplicación que ahora te envuelve con su majestad. ~Conjugar~ te permite practicar la conjugación de ~todos~ los tiempos verbales en español por medio de tests para que las conjugaciones correctas estén en tu cerebro en el momento exacto en que las necesites. ~Conjugar~ convierte esta experiencia en un juego calificando cada sesión de práctica y ofreciéndote la posibilidad de subiéndola a Game Center, lo que te permite competir contra la comunidad global de conjugación de verbos en español. Algunos tiempos son raros de encontrar fuera de textos antiguos o formales y son menos útiles para muchos estudiantes. Por lo tanto, ~Conjugar~ proporciona tres niveles de dificultad para las sesiones de práctica. ~Fácil~ prueba los tres tiempos más importantes. ~Moderado~ prueba todos los tiempos que los hispanohablantes usan comúnmente. ~Difícil~ prueba ~todos~ los tiempos, incluyendo algunos que es poco probable que se encuentre a menos que estés leyendo, por ejemplo, ~El ingenioso hidalgo don Quijote de la Mancha~.

^Uso^

Para moverte por los contenidos de ~Conjugar~, usa las pestañas que verás en la parte inferior de la pantalla. Las descripciones de estas pestañas se detallan a continuación.

La primera pestaña de ~Conjugar~ se llama ~Explorar~. Esta pestaña presenta miles de verbos en español con sus traducciones al inglés. Los verbos más comunes también muestran su rango de frecuencia; \"ser\", el verbo más común de todos, es el #1. Ordena los verbos por frecuencia o alfabéticamente tocando el control amarillo que hay encima de la barra de pestañas. Cuando encuentres un verbo sobre el que te gustaría saber más, tócalo. ~Conjugar~ te mostrará una pantalla con ~todas~ las conjugaciones de ese verbo. Esta pantalla es útil para el aprendizaje porque resalta en $ROJO$ las partes de las conjugaciones que son irregulares. Por ejemplo, en %presente de indicativo%, la conjugación en primera persona del singular de \"dar\" tiene una \"y\" irregular, por lo que ~Conjugar~ muestra esta conjugación como \"$doY$\". Toca cualquier conjugación para escucharla. Toca ~Explorar~ en la esquina superior izquierda para volver a la pestaña ~Explorar~.

Toca ~Test~ en la barra de pestañas para empezar un test. Toca ~Comenzar~ en la esquina inferior izquierda de la pantalla. ~Conjugar~ te presentará un conjunto de cincuenta verbos en español. ¡A conjugarlos!

Si hay una letra en una palabra como \"habló\" que requiere un acento y introduces, por ejemplo, \"hablo\", recibirás una puntuación parcial por esa conjugación. Para introducir una letra acentuada, mantén presionado el dedo (\"pulsación larga\") en la letra que deseas acentuar. Por ejemplo, \"o\", desliza tu dedo hacia la letra acentuada, \"ó\" y suéltalo.

Cuando hayas terminado con el test, ~Conjugar~ te informará y te dará puntos por tus resultados, y cargará la puntuación en Game Center si has mejorado tu marca personal. Toca ~Test~ en la esquina superior izquierda para volver a la pestaña de ~Test~. Ahora puedes comenzar un nuevo test.

Toca ~Configuración~ en la barra de pestañas para acceder a la configuración.

Una clase de conjugaciones, las de ~vosotros~, es importante en España pero no se usa en América Latina. Si tu objetivo es comunicarte con hispanohablantes latinoamericanos, es posible que desees que ~Conjugar~ omita las conjugaciones de ~vosotros~ de los tests. Si es así, toca ~América Latina~ en la sección ~Región~.

~Conjugar~ asigna puntuaciones más altas a los tests que incluyen las conjugaciones de ~vosotros~ para reconocer el esfuerzo extra de aprenderlas.

Los tiempos verbales del español se pueden agrupar en tres clases. La primera clase cuenta con el numéro mínimo de tiempos verbales que necesitarás para expresarte en español. Si tu objetivo es solo expresarte en español, toca ~Fácil~ en la sección ~Dificultad~. ~Conjugar~ solo te hará preguntas sobre estos tiempos. La segunda clase contiene los tiempos verbales que los hablantes nativos del español usan a diario cuando hablan y esriben. Si tu objetivo es comprender el español hablado y escrito, toca ~Moderado~ en la sección ~Dificultad~. ~Conjugar~ te preguntará sobre estos tiempos. La tercera clase incluye todos los tiempos verbales del español, incluyendo algunos que se consideran arcaicos o que rara vez se usan fuera de la escritura formal. Si tu objetivo es comprender textos antiguos o formales en español, toca ~Difícil~ en la sección ~Dificultad~. ~Conjugar~ te hará preguntas sobre ~todos~ los tiempos verbales del español.

Para reconocer el esfuerzo de aprender a conjugar las clases de verbos ~Fácil~, ~Moderado~ y ~Difícil~, ~Conjugar~ asigna puntuaciones más altas a los tests ~Moderados~ que a los tests ~Fáciles~ y asigna puntuaciones más altas a los ~Difíciles~ que a los ~Moderados~.

Como se describe en otra parte de ~Conjugar~, el %voseo% consiste en el uso que ciertos hispanohablantes hacen del pronombre ~vos~ y de sus conjugaciones, en lugar de emplear las de ~tú~.

En la sección ~Configuración~ \"Explorar Tú y / o Vos\", toca \"Vos\" para ver las conjugaciones ~vos~ en lugar de las conjugaciones de ~tú~ en la pestaña ~Test~. Toca \"Ambas\" para ver ambas.

En la sección ~Configuración~ \"Hacer el Test de Tú o Vos\", toca \"Vos\" para hacer un test con las conjugaciones de ~vos~ en lugar de las de ~tú~.

Toca ~Informacíon~ en la barra de pestañas para acceder a información sobre ~Conjugar~, su %terminología% y los tiempos verbales. Cerca de la parte inferior de la pantalla hay un ajuste en $ROJO$ para filtrar información sobre tiempos según el modo de dificultad en el que se preguntan. Las tres opciones son ~Fácil~; ~Fácil~ y ~Moderado~; y ~Fácil~, ~Moderado~ y ~Difícil~.";

"terminologyText" = "^Verbo^

Un ~verbo~ es un tipo de palabra que representa una acción en una oración. En la oración \"Celina Zambon baila el flamenco\", \"bailar\" es el verbo. Los tiempos verbales expresan, entre otras cosas, cuándo se realiza la acción. En la oración de ejemplo, el tiempo verbal expresa que la acción se está llevando a cabo ahora mismo. En español, el ~sujeto~ o actor en la oración determina la forma exacta del verbo utilizado junto con el tiempo verbal en práticamente todos los casos. Este es la ~conjugación~ del verbo. En español, la combinación de sujeto y tiempo de la oración de ejemplo da como resultado la conjugación \"baila\".

El ~infinitivo~ es un forma invariable del verbo que termina en -ar, -er o -ir. No indica tiempo, número ni persona. \"Bailar\" es un ejemplo de infinitivo. Los diccionarios de español y la pestaña Explorar de ~Conjugar~ presentan los verbos con sus formas en infinitivo.

La ~raíz del verbo~ es el inifinitivo sin la terminación -ar, -ir o -er.

^Pronombre^

Un ~pronombre~ personal es una palabra que representa a un sujeto. En español, los pronombres personales que pueden actuar como sujetos son ~yo~, ~tú~, ~vos~, ~usted~, ~él~/~ella~, ~nosotros~/~nosotras~, ~vosotras~/~vosotros~, ~ustedes~ y ~ellas~/~ellos~.

Tanto en español como en inglés, los pronombres de sujeto pueden tener el número ~singular~ o ~plural~. También pueden ser de ~primera persona~, ~segunda persona~ o ~tercera persona~. Estos son los pronombres personales del español, incluyendo las combinaciones de persona y número:

primera persona, singular: ~yo~
segunda persona, singular: ~tú~ / ~vos~ / ~usted~
tercera persona, singular: ~él~ / ~ella~
primera persona, plural: ~nosotras~ / ~nosotros~
segunda persona, plural: ~vosotras~ / ~vosotros~ / ~ustedes~
tercera persona, plural: ~ellos~ / ~ellas~

Los pronombres de sujeto en segunda persona del español son complicados porque expresan dos niveles de formalidad, formal y informal. Además, los usos de estos pronombres en España y América Latina son muy diferentes. \"Vosotros\" solo se usa en España, y \"vos\" solo se usa en algunas partes de América Latina.

~España~

segunda persona, singular, informal: ~tú~
segunda persona, singular, formal: ~usted~
segunda persona, plural, informal: ~vosotros~ / ~vosotras~
segunda persona, plural, formal: ~ustedes~

~Algunas Regiones de América Latina (p.ej., Argentina)~

segunda persona, singular, informal: ~vos~
segunda persona, singular, formal: ~usted~
segunda persona, plural, informal: ~ustedes~
segunda persona, plural, formal: ~ustedes~

~Otra Regiones de América Latina (p.ej., Peru)~

segunda persona, singular, informal: ~tú~
segunda persona, singular, formal: ~usted~
segunda persona, plural, informal: ~ustedes~
segunda persona, plural, formal: ~ustedes~

Usted y ustedes usan las conjugaciones de él y ellos, respectivamente.

~Ustedes~ sustituye a ~vosotros~ / ~vosotras~ en América Latina. De este modo, los estudiantes de español deben aprender seis formas verbales cuando estudian las conjugaciones en España, pero en América Latina deben aprender solo cinco formas verbales.

Como ya hemos dicho, en algunas regiones de América Latina, ~vos~ susituye a ~tú~ y usa diferentes conjugaciones. Este fenómeno se llama %voseo%. Toca la palabra en azul para leer una descripción de este fenómeno.

^Orden y Presentación de Conjugaciones^

Los tratados sobre verbos españoles presentan las conjugaciones en el siguiente orden de sujeto y pronombre: yo, tú, él, nosotros, vosotros, ellos. Para una mayor claridad y brevedad, ~Conjugar~ hace lo mismo. Por ejemplo, ~Conjugar~ presenta las conjugaciones %presente de indicativo% de ~ser~ de la siguiente manera:

$soY$, $ERes$, $ES$, $sOmos$, $sOis$, $sOn$

Las letras en rojo de las conjugaciones señalan las formas irregulares. Un verbo se considera irregular si alguna de sus formas es diferente de las que emplea un verbo regular ~ar~, ~ir~ o ~er~.";

"presenteDeIndicativoText" = "^Usos^

El ~presente de indicativo~ es un tiempo verbal del español que se utiliza para expresar lo siguiente:

• Acción que se realiza en el momento en el que se está hablando:

\"Malteamos.\" = \"We are malting.\"

• Accion que se realiza en el momento en el que se está hablando:

\"Malteamos.\" = \"We have a habit of malting.\" o \"We malt.\"

• Énfasis en la acción que se está realizando ahora mismo:

\"Sí, malteamos.\" = \"Yes, we ~do~ malt.\"

^Conjugación^

Los verbos regulares terminados en ~ar~, ~ir~ y ~er~ se conjugan en presente de indicativo agregando las siguientes terminaciones a la raíz del verbo:

AR: -o, -as, -a, -amos, -áis, -an
IR: -o, -es, -e, -imos, -ís, -en
ER: -o, -es, -e, -emos, -éis, -en

Ejemplos:

habl~ar~: hablo, hablas, habla, hablamos, habláis, hablan
sub~ir~: subo, subes, sube, subimos, subís, suben
com~er~: como, come, come, comemos, coméis, comen

Hay dos verbos irregulares en presente de indicativo que merecen una nota especial.

~Estar~ se usa en presente de indicativo junto con el %gerundio% para enfatizar la naturaleza continua de una acción. Por ejemplo, para traducir la oración inglesa \"I am reading\", se podría decir \"$estoY leYendo$\".

~Haber~ se usa en presente de indicativo junto con el %participio% para formar los tiempos en %perfecto de indicativo%, un tiempo verbal popular en los países de habla hispana. Toca las palabras azules para obtener descripciones.

A continuación aparecen algunos otros verbos que son irregulares en presente de indicativo. Toca la pestaña ~Explorar~ para ver sus traducciones y conjugaciones.

caber, caer, conocer, conducir, construir, crecer, dar, decir, dormir, hacer, huir, ir, jugar, lucir, oír, pedir, pensar, perder, poner, saber, salir, ser, sentir, tener, traer, valer, venir, ver";

"futuroDeIndicativoText" = "^Usos^

El ~futuro de indicativo~ es un tiempo verbal del español que se utiliza para expresar lo siguiente:

• Una acción futura:

\"El año próximo, visitaré Buenos Aires.\" = \"Next year, I shall/will visit Buenos Aires.\"

• Incertidumbre o probabilidad; inferencia o deducción, en lugar de conocimiento directo:

\"¿Quién estará tocando a la puerta?\" \"Será Fabio.\" = \"Who (do you suppose) is knocking at the door?\" \"It must be Fabio.\" o \"Who will that be knocking at the door?\" \"That'll be Fabio.\"

• Orden, prohibición u obligación:

\"No llevarás a ese hombre a mi casa.\" = \"Do not bring that man to my house.\" o \"You will not bring that man to my house.\"

Esta forma también se utiliza para hacer valer una orden, prohibición u obligación en inglés.

• Cortesía:

\"¿Te importará encender la televisión? \" = \"Would you mind turning on the television?\"

Otra forma común de representar el futuro es con una forma del %presente de indicativo% de ~ir~ seguida de un verbo en infinitivo: \"Quizás $VOY$ a viajar a Bolivia este verano. = \"Perhaps I'm going to travel to Bolivia in the summer.\"

^Conjugación^

El futuro de indicativo utiliza la %raíz futura% como base. Se le adjuntan las siguientes terminaciones:

-é, -ás, -á, -emos, -éis, -án

Ejemplo (hablar): hablaré, hablarás, hablará, hablaremos, hablaréis, hablarán

Ve a %créditos% para leer la atribución a la Wikipedia.";

"pretéritoText" = "^Usos^

El ~pretérito~ es un tiempo verbal del español que se utiliza para expresar lo siguiente:

• Una acción que se realizó en el pasado:

\"Ayer encontré la flor que tú me $dIste$.\" = \"Yesterday, I found the flower that you $gAve$ me.\"

Este uso expresa una acción que se entiende como un evento terminado. A menudo se acompaña de expresiones de tiempo adverbiales, como \"ayer\", \"anteayer\" o \"la semana pasada\".

• Una acción que interrumpe otra acción:

\"Estábamos cenando cuando entró Eduardo.\" = \"We were having dinner when Eduardo $cAme$ in.\"

Esto expresa un evento que sucedió (y se completó) mientras se realizaba otra acción.

• Una verdad general:

\"Las Filipinas $FUeron$ parte del Imperio Español.\" = \"The Philippines were part of the Spanish Empire.\"

Esto expresa una acción o situación pasada que se ve como terminada.

^Conjugación^

Los verbos regulares terminados en ~ar~, ~ir~ y ~er~ se conjugan en pretérito agregando las siguientes terminaciones a la raíz del verbo:

AR: -é, -aste, -ó, -amos, -astéis, -aron
IR: -í, -iste, -ió, -imos, -isteis, -ieron
ER: -í, -iste, -ió, -imos, -isteis, -ieron

Ejemplos:

habl~ar~: hablé, hablaste, habló, hablamos, hablastéis, hablaron
sub~ir~: subí, subiste, subió, subimos, subisteis, subieron
com~er~: comí, comiste, comió, comimos, comisteis, comieron

A continuación aparecen algunos verbos que son irregulares en pretérito. Toca la pestaña ~Explorar~ para ver sus traducciones y conjugaciones.

andar, caber, conducir, dar, decir, estar, haber, hacer, ir, poder, poner, querer, saber, ser, tener, traer, venir

Ve a %créditos% para leer la atribución a la Wikipedia.";

"condicionalText" = "^Usos^

El ~condicional~ se utiliza para expresar lo siguiente:

• Cortesía:

\"Señor, ¿$podRía$ darme una copa de vino?\" = \"Sir, could you give me a glass of wine?\"

Este uso suaviza una solicitud, haciéndola más educada.

• Expresión cortés de un deseo cuando se usa con querer:

\"Q$ueRría$ ver la película esta semana.\" = \"I would like to see the film this week.\"

• En una acción que necesita que se cumpla una condición para poderse llevar a cabo. Esta condición está marcada por la conjunción condicional \"si\":

\"Si yo $FUera$ rico, viajaría a Sudamérica.\" = \"If I $WERE$ rich, (then) I would travel to South America.\"

• Suposición sobre eventos pasados:

\"¿Cuántas personas asistieron a la investidura del Presidente?\" \"No lo $sÉ$; $habRía$ unas 5.000.\" = \"How many people attended the President's inauguration?\" \"I do not know; there must have been about 5,000.\"

En este contexto, el conocimiento del hablante es indirecto, no confirmado o aproximado.

• Una acción futura que se relaciona con el pasado:

\"Cuando $ERa$ pequeño, pensaba que me gustaría ser médico.\" = \"When I $WAS$ young, I thought that I would like to be a doctor.\"

Este uso expresa una acción futura que se imaginó en el pasado.

• Una sugerencia:

\"Yo que tú, lo olvidaría completamente.\" = \"If I $WERE$ you, I would forget him completely.\"

^Conjugación^

Al igual que en %futuro de indicativo%, el condicional usa la %raíz futura%. Para formar el condicional, se usan las siguientes terminaciones con la raíz futura:

-ía, -ías, -ía, -íamos, -íais, -ían

Ejemplo con hablar: hablaría, hablarías, hablaría, hablaríamos, hablaríais, hablarían

Ve a %créditos% para leer la atribución a la Wikipedia.";

"imperfectoDeIndicativoText" = "^Usos^

Al igual que el %pretérito% y el %perfecto de indicativo%, el ~imperfecto de indicativo~ se usa para eventos pasados. Sin embargo, el imperfecto de indicativo se usa para:

• Una acción habitual o repetida:

\"Cada año mi familia $iBa$ a Puerto Rico.\" = \"Each year my family $WENT$ to Rich Port.\"

\"El gato saltaba al sofá muy a menudo.\" = \"The cat often jumped on the couch.\"

• Una acción pasada habitual que ~no~ continuó hasta el presente:

\"Yo leía el diário.\" = \"~I~ used to read the newspaper.\"

• Un evento que ocurrió al mismo tiempo que otro siempre que los dos eventos aparezcan en la misma oración:

\"Mientras cruzaba la calle, me atropelló un coche.\" = \"While I was crossing the road, a car $rAn$ me over.\"

^Conjugación^

Los verbos regulares en ~ar~, ~ir~ y ~er~ se conjugan en imperfecto de indicativo agregando las siguientes terminaciones a la raíz del verbo:

AR: -aba, -abas, -aba, -ábamos, -abais, -aban
IR: -ía, -ías, -ía, -íamos, -íais, -ían
ER: -ía, -ías, -ía, -íamos, -íais, -ían

Ejemplos:

habl~ar~: hablaba, hablabas, hablaba, hablábamos, hablabais, hablaban
sub~ir~: subía, subías, subía, subíamos, subíais, subían
com~er~: comía, comías, comía, comíamos, comíais, comían

Solo hay tres verbos irregulares en imperfecto de indicativo: ir, ser y ver. Toca la pestaña ~Explorar~ para ver sus traducciones y conjugaciones.

Ve a %créditos% para leer la atribución a la Wikipedia.";

"presenteDeSubjuntivoText" = "^Usos^

El ~presente de subjuntivo~ se usa para expresar:

• Una orden:

\"Nos manda que $platiQUemos$.\" = \"He $IS$ ordering us to talk.\"

• Un estado emocional:

\"Tengo miedo de que Colombia no gane la Copa América este año.\" = \"I fear that Colombia will not win the America Cup this year.\"

• Duda:

\"Dudo que $venGas$ mañana.\" = \"I doubt that thou $wilT$ come tomorrow.\"

^Conjugación^

Los verbos regulares en ~ar~, ~ir~ y ~er~ se conjugan en presente de subjuntivo agregando las siguientes terminaciones a la raíz del verbo:

AR: -e, -es, -e, -emos, -éis, -en
IR: -a, -as, -a, -amos, -áis, -an
ER: -a, -as, -a, -amos, -áis, -an

Ejemplos:

habl~ar~: hable, hables, hable, hablemos, habléis, hablen
sub~ir~: suba, subas, suba, subamos, subáis, suban
com~er~: coma, comas, coma, comamos, comáis, coman

A continuación aparecen algunos verbos que son irregulares en presente de subjuntivo. Toca la pestaña ~Explorar~ para ver sus traducciones y conjugaciones.

caber, caer, conducir, conocer, construir, crecer, dar, decir, dormir, estar, ir, haber, hacer, huir, jugar, lucir, escuchar, pedir, pensar, perder, poner, sable, sentir, ser, salir, tener, traer, valer, venir, ver";

"imperfectoDeSubjuntivo1Text" = "^Uso^

El ~imperfecto de subjuntivo 1~ sirve para unos usos similares a los del %presente de subjuntivo% pero colocandos las acciones en pasado. Aquí hay algunos ejemplos de usos de este tiempo.

• Una orden:

\"Nos mandó que platicáramos.\" = \"He ordered us to talk.\"

• Un estado emocional:

\"Temía que Colombia no ganara la Copa América este año.\" = \"I feared that Colombia would not win the America Cup this year.\"

• Duda:

\"Dudaba que $vIniera$ hoy.\" = \"I doubted that you would come today.\"

Los expertos en gramática consideran que el imperfecto de subjuntivo 1 y el %imperfecto de subjuntivo 2% son variantes diferentes del mismo tiempo, a los que simplemente se les llama \"imperfecto de subjuntivo\". En español moderno, los usos de las dos variantes no difieren. El desarrollador de ~Conjugar~ ha tratado estas variantes como tiempos separados con diferentes nombres con fines pedagógicos.

^Conjugación^

Los verbos se conjugan en imperfecto de subjuntivo 1 eliminando la terminación -ron de la forma ellos del %pretérito% del verbo y agregando la siguiente terminación, dependiendo de la persona y el número del sujeto:

yo: -ra
tú: -ras
él: -ra
nosotros: -ramos
vosotros: -rais
ellos: -ran

Ejemplo (cantar): cantara, cantaras, cantara, cantáramos, cantarais, cantaran

Como se muestra en el ejemplo, la vocal que aparece antes del final de la conjugación de nosotros tiene un acento para indicar que esa es la sílaba tónica y que su pronunciación es, por lo tanto, un poco diferente del resto de formas de este tiempo verbal.

Ve a %créditos% para leer la atribución a la Wikipedia.";

"imperfectoDeSubjuntivo2Text" = "^Uso^

El ~imperfecto de subjuntivo 2~ sirve para unos usos similares a los del %presente de subjuntivo% pero colocando las acciones en pasado. Aquí hay algunos ejemplos de usos de este tiempo.

• Una orden:

\"Nos mandó que platicásemos.\" = \"He ordered us to talk.\"

• Un estado emocional:

\"Temía que Colombia no ganase la Copa América este año.\" = \"I feared that Colombia would not win the America Cup this year.\"

• Duda:

\"Dudaba que $vIniese$ hoy.\" = \"I doubted that you would come today.\"

Los expertos en gramática consideran que imperfecto de subjuntivo 2 y el %imperfecto de subjuntivo 1% son variantes diferentes del mismo tiempo, a los que simplemente se les llama \"imperfecto de subjuntivo\". En español moderno, los usos de las dos variantes no difieren. El desarrollador de ~Conjugar~ ha tratado estas variantes como tiempos separados con diferentes nombres con fines pedagógicos.

^Conjugación^

Los verbos se conjugan en imperfecto de subjuntivo 2 eliminando la terminación -ron de la forma ellos del %pretérito% del verbo y agregando la siguiente terminación, dependiendo de la persona y el número del sujeto:

yo: -se
tú: -ses
él: -se
nosotros: -semos
vosotros: -seis
ellos: -sen

Ejemplo (cantar): cantase, cantases, cantase, cantásemos, cantaseis, cantasen

Como se muestra en el ejemplo, la vocal que aparece antes del final de la conjugación de nosotros tiene un acento para indicar que esa es la sílaba tónica y que su pronunciación es, por lo tanto, un poco diferente del resto de formas de este tiempo verbal.

Ve a %créditos% para leer la atribución a la Wikipedia.";

"futuroDeSubjuntivoText" = "^Uso^

El ~futuro de subjunctivo~ ya no se usa en español moderno, excepto en lenguaje legal y algunas expresiones fijas.

\"Donde fueres, $haZ$ lo que vieres.\" = \"When in Rome, do as the Romans do.\" = \"Cum Romae fueritis, Romano vivite more.\"

En estas expresiones, este tiempo se usa para expresar dudas o incertidumbre acerca de si algún evento ocurrirá en el futuro. En español moderno, el %presente de subjuntivo% reemplaza al futuro de subjuntivo. Aquí hay ejemplos del futuro de subjuntivo:

\"Cuando hablaren...\" = \"Whenever they might speak...\"

\"$venGa$ lo que $vIniere$\" = \"come what may\"

\"El que matare al rey será castigado.\" = \"Whoever kills the king will be punished.\"

Este último ejemplo es de una ley penal española. El uso del futuro de subjuntivo en esta ley alude a la lejanía de la posibilidad de que el rey español sea asesinado. ¡Viva el Rey!

^Conjugación^

Los verbos se conjugan en futuro de subjuntivo eliminando la terminación -ron de la forma para el pronombre \"ellos\" del %pretérito% del verbo y agregándole la siguiente terminación, dependiendo de la persona y el número del sujeto:

yo: -re
tú: -res
él: -re
nosotros: -remos
vosotros: -reis
ellos: -ren

Ejemplo (cantar): cantare, cantares, cantare, cantáremos, cantareis, cantaren

Como se muestra en el ejemplo, la vocal que aparace antes del final de la conjugación de \"nosotros\" tiene un acento para indicar que esa es la sílabla tónica.

Ve a %créditos% para leer la atribución a la Wikipedia.";

"imperativoPositivoText" = "^Uso^

El ~imperativo positivo~ se usa en español para expresar las órdenes.

\"Levanten la mano derecha.\" = \"Raise your right hand(s).\"

\"Regresad.\" = \"Y'all come back.\"

\"D$I$lo.\" = \"Say it.\"

\"Tejamos.\" = \"Let's knit.\"

^Conjugación^

Para la conjugación del imperativo positivo de nosotros, usted y ustedes usaremos la conjugación del %presente de subjuntivo%. Tú usa la conjugación del %presente de indicativo% sin la s final. Vosotros usa el infinitivo sin la r final y con una d.

Así, para los verbos regulares en ~ar~, ~ir~ y ~er~, las terminaciones son las siguientes. Ten en cuenta que no hay formas yo.

AR: -a, -e, -emos, -ad, -en
IR: -e, -a, -amos, -id, -an
ER: -e, -a, -amos, -ed, -an

Ejemplos:

habl~ar~: habla, hable, hablemos, hablad, hablen
sub~ir~: sube, suba, subamos, subid, suban
com~er~: come, coma, comamos, comed, coman

Los siguientes verbos tienen conjugaciones irregulares de tú en imperativo positivo:

componer: $compóN$
decir: $dI$
hacer: $haZ$
ir: $VE$
obtener: $obtÉn$
poner: $poN$
salir: $saL$
ser: $sÉ$
tener: $teN$
venir: $veN$";

"imperativoNegativoText" = "^Uso^

El ~imperativo negativo~ se usa en español para expresar órdenes negativas.

\"No levanten la mano derecha.\" = \"Don't raise your right hand(s).\"

\"No regreséis.\" = \"Don't come back, y'all.\"

\"No lo $dIGa$.\" = \"Don't say it.\"

\"No tejamos.\" = \"Let's not knit.\"

^Conjugación^

Para conjugar el imperativo negativo, se coloca la palabra \"no\" delante de la conjugación de %presente de subjuntivo%. Por lo tanto, para los verbos regulares que terminan en ~ar~, ~ir~ y ~er~, las terminaciones son las siguientes. Ten en cuenta que no hay una forma para usar con el pronombre yo.

AR: -e, -es, -e, -emos, -éis, -en
IR: -a, -as, -a, -amos, -áis, -an
ER: -a, -as, -a, -amos, -áis, -an

Ejemplos:

habl~ar~: no hables, no hable, no hablemos, no habléis, no hablen
sub~ir~: no subas, no suba, no subamos, no subaís, no suban
com~er~: no comas, no coma, no comamos, no comáis, no coman";

"participioText" = "^Uso^

El ~participio~ corresponde a la forma inglesa terminanda en -en, -ed, o -t de un verbo. Esta forma se usa tras el verbo auxiliar ~haber~ para formar los tiempos compuestos, como por ejemplo el %perfecto de indicativo%: \"(Yo) $ hE $ hablado.\" = \"I have $spOken$.\"

^Forma^

El participio se forma agregando las siguientes terminaciones a la raíz del verbo:

Verbos ~ar~: -ado

Ejemplos: hablado (\"$spOken$\"); cantado (\"$sUng$\"); bailado (\"danced\")

Verbos ~er~: -ido

Ejemplos: bebido (\"$drUnk$\"); leído (requiere un acento; \"$reaD$\"); comprendido (\"$understOOd$\")

Verbos ~ir~: -ido

Ejemplos: vivido (\"lived\"); sentido (\"$fElt$\"); hervido (\"boiled\")

Cuando el participio se usa como un adjetivo, refleja tanto el género como el número del nombre al que acompaña. Ejemplo: \"una lengua hablada en España\" = \"a language spoken in Spain\"

Los siguientes verbos tienen participios irregulares:

abrir: $abIERTo$
cubrir: $cubIERTo$
decir: $dICHo$
escribir: $escriTo$
hacer: $hECHo$
morir: $mUERTo$
poner: $pUESTo$
pudrir: $pOdrido$
resolver: $resUELTo$
romper: $roTo$
ver: $vISTo$
volver: $vUElTo$

Ve a %créditos% para ver la atribución a la Wikipedia.";

"gerundioText" = "^Usos^

El ~gerundio~ tiene una gran variedad de usos. El gerundio de hacer, haciendo, en inglés puede equivaler a \"doing\", \"while doing\", \"by doing\", \"because of one's doing\" o \"through doing\".

El gerundio también se usa para formar una perífrasis verbal con valor progresivo. Ejemplo: \"$estoY haciendo$\" (\"I $AM$ doing\")

El gerundio no se puede usar como adjetivo y, a diferencia de la mayoría de las lenguas europeas, no tiene formas de adjetivo propias. El presente participio presente, que terminaba en -ante o -iente y anteriormente cumplía esta función, en algunos casos sobrevive como un adjetivo. Por ejemplo, \"$dUrmiente$\" = \"sleeping\", y \"interesante\" = \"interesting\", pero estos casos son limitados. Por lo general, las construcciones alternativas al uso del gerundio como ajetivo son apropiadas. Mientras que en inglés se diría \"the crying baby\", se diría en español \"el bebé que llora\", que literalmente significa \"the baby who is crying\".

^Forma^

El gerundio se forma agregando las siguientes terminaciones a la raíz del verbo:

Verbos ~ar~: -ando

Ejemplos: hablando (\"speaking\"); cantando (\"singing\"); bailando (\"dancing\")

Verbos ~er~: -iendo

Ejemplos: bebiendo (\"drinking\"); cediendo (\"yielding\"); comprendiendo (\"understanding\")

Verbos ~ir~: -iendo

Ejemplos: viviendo (\"living\"); decidiendo (\"deciding\"); compartiendo (\"sharing\")

Los siguientes verbos tienen gerundios irregulares:

bullir: $bullEndo$
caer: $caYendo$
construir: $construYendo$
dormir: $dUrmiendo$
hervir: $hIrviendo$
huir: $huYendo$
ir: $Yendo$
leer: $leYendo$
medir: $mIdiendo$
oír: $oYendo$
poder: $pUdiendo$
sentir: $sIntiendo$
tañer: $tañEndo$
traer: $traYendo$

Ve a %créditos% para leer la atribución a la Wikipedia.";

"raízFuturaText" = "^Usos^

Las formas de verbos con ~raíz futura~ se usan como derivaciones para los tiempos %condicional% y %futuro de indicativo%. Toca esos tiempos para obtener descripciones de ellos.

^Forma^

Para todos los verbos excepto doce, la raíz futura es idéntica a la forma del infinitivo. Por ejemplo, la raíz futura de ~bailar~ es \"bailar-\".

Los siguientes verbos tienen formas de raíz futura irregulares:

caber: $cabR$-
decir: $dIR$-
haber: $habR$-
hacer: $haR$-
poder: $podR$-
poner: $ponDr$-
querer: $querR$-
saber: $sabR$-
salir: $salDr$-
tener: $tenDr$-
valer: $valDr$-
venir: $venDr$-";

"perfectoDeIndicativoText" = "^Usos^

El ~perfecto de indicativo~ tiene prácticamente el mismo uso que el tiempo inglés conocido como \"present perfect\".

\"Te $ hE dICHo $ mi opinión.\" = \"I have $tOLD$ you my opinion.\" o \"I $tOLD$ you my opinion, and it hasn't changed.\"

Tanto en español como en inglés, este tiempo implica que una acción, aunque se completó en el pasado, tiene efectos, es verdad o tiene relevancia en el presente.

^Conjugación^

En perfecto de indicativo, las formas del %presente de indicativo% de ~haber~ se usa como auxiliar, y le sigue el %participio% del verbo que se conjuga.

Ejemplo: \"$hEmos hablado$\" = \"we have $spOken$\"

Ve a %créditos% para ver la atribución a la Wikipedia.";

"pretéritoAnteriorText" = "^Uso^

El ~pretérito anterior~ es muy raro en el español hablado, pero a veces se usa en lenguaje escrito formal, donde se limita a oraciones subordinadas en casi todos los casos. Por lo tanto, generalmente aparecen conjunciones temporales antes de esta forma verbal como cuando, apenas o en cuanto. Este tiempo se usa para expresar una acción que terminó inmediatamente antes de otra acción pasada.

\"Cuando $hUbieron llegado$ todos, comenzó la ceremonia.\" = \"When everyone had arrived, the ceremony $begAn$.\"

\"Apenas María $hUBO terminado$ la canción, su padre entró.\" = \"As soon as Mary had finished the song, her father $cAme$ in.\"

^Conjugación^

En pretérito anterior, la conjugación en %pretérito% de ~haber~ se usa como auxiliar, seguida del %participio% del verbo que se conjuga.

Ejemplo: \"$hUBE hablado$\" = \"I had $spOken$\"

Ve a %créditos% para leer la atribución a la Wikipedia.";

"pluscuamperfectoDeIndicativoText" = "^Uso^

El ~pluscuamperfecto de indicativo~ expresa una acción pasada que ocurrió antes de otra acción pasada.

\"Cuando bajé a la cocina, mis hijos ya habían preparado el desayuno.\" = \"When I went downstairs to the kitchen, the children had already prepared breakfast.\"

^Conjugación^

En pluscuamperfecto de indicativo, la conjugación del %imperfecto de indicativo% de ~haber~ se usa como auxiliar, y le sigue el %participio% del verbo que se conjuga. Este tiempo tiene prácticamente el mismo uso que el tiempo inglés conocido como \"past perfect\".

Ejemplo: \"$había hablado$ \" = \"it had $spOken$\"

Ve a %créditos% para leer la atribución a la Wikipedia.";

"futuroPerfectoText" = "^Uso^

El ~futuro perfecto~ se usa para indicar una acción futura que se terminará antes de que ocurra otra acción.

\"Cuando llegue a la fiesta, ya se $habRán$ marchado todos.\" = \"When I get to the party, everyone will already have $leFT$.\"

^Conjugación^

En futuro perfecto, la conjugación del %futuro de indicativo% de ~haber~ se usa como auxiliar, seguida del %participio% del verbo que se conjuga.

Ejemplo: \"$habRé hablado$\" = \"I will have $spOken$\"

Ve a %créditos% para leer la atribución a la Wikipedia.";

"condicionalCompuestoText" = "^Uso^

El ~condicional compuesto~ se refiere a una acción hipotética en pasado.

\"Yo $habRía hablado$ si me $hUbieran dado$ la oportunidad.\" = \"I would have $spOken$ if they had given me the opportunity.\"

^Conjugación^

En condicional compuesto, la conjugación del %condicional% de ~haber~ se usa como auxiliar, y le sigue el %participio% del verbo que se conjuga.

Ejemplo: \"$habRías decidido$\" = \"you would have decided\"

Ve a %créditos% para leer la atribución a la Wikipedia.";

"perfectoDeSubjuntivoText" = "^Uso^

El ~perfecto de subjuntivo~ expresa dudas, incertidumbre, incredulidad o un estado emocional con respecto a una acción pasada o a una acción que se completará antes de alguna otra acción.

\"Lamentan que él no $haYa podido$ regresar a la casa.\" = \"They regret that he $WAS$ unable to return home.\"

\"Es posible que al finales de este siglo Colombia no $haYa ganado$ la Copa América.\" = \"At the end of the century, it's possible that Colombia will not have $wOn$ the America Cup.\"

\"Dudo que $haYas venido$ antes del final de la película.\" = \"I doubt that you will have come before the end of the movie.\"

^Conjugación^

En perfecto de subjuntivo, se usa la conjugación del %presente de subjuntivo% de ~haber~ como auxiliar, y le sigue el %participio% del verbo que se conjuga.

Ejemplo: \"$haYa hablado$\" = \"I $spOke$\" o \"I have $spOken$\"

Ve a %créditos% para leer la atribución a la Wikipedia.";

"pluscuamperfectoDeSubjuntivo1Text" = "^Uso^

El ~pluscuamperfecto de subjuntivo 1~ expresa dudas, incertidumbre o un estado emocional con respecto a una acción que ocurrió antes de otra acción pasada. Como se muestra en el siguiente ejemplo, este tiempo a menudo se usa con el %condicional compuesto%. Este tiempo tiene el mismo uso que el tiempo inglés conocido como \"third conditional\".

\"Si me $hUbiera traÍdo$ una chaqueta, ahora no $tendRía$ frío.\" = \"If I had $brOUGHT$ a jacket, I wouldn't be cold now.\"

Los expertos en gramática consideran que el pluscuamperfecto de subjuntivo 1 y el %pluscuamperfecto de subjuntivo 2% son variantes diferentes del mismo tiempo, a los que simplemente se les llama \"pluscuamperfecto de subjuntivo\". En español moderno, los usos de las dos variantes no difieren. El desarrollador de ~Conjugar~ ha tratado estas variantes como tiempos separados con diferentes nombres con fines pedagógicos.

^Conjugación^

En pluscuamperfecto de subjuntivo 1, se usa la conjugación del %imperfecto de subjuntivo 1% de ~haber~ como auxiliar, y le sigue el %participio% del verbo que se conjuga.

Ejemplo: \"$hUbiera hablado$\" = \"I had $spOken$\"";

"pluscuamperfectoDeSubjuntivo2Text" = "^Uso^

El ~pluscuamperfecto de subjuntivo 2~ expresa dudas, incertidumbre o un estado emocional con respecto a una acción que ocurre antes de otra acción pasada. Como se muestra en el siguiente ejemplo, este tiempo a menudo se usa con el %condicional compuesto%.

\"Si me $hUbiese traÍdo$ una chaqueta, ahora no $tendRía$ frío.\" = \"If I had $brOUGHT$ a jacket, I wouldn't be cold now.\"

Los gramáticos consideran que el pluscuamperfecto de subjuntivo 2 y el %pluscuamperfecto de subjuntivo 1% son diferentes variantes del mismo tiempo llamado simplemente \"pluscuamperfecto de subjuntivo\". En español moderno, los usos de las dos variantes no difieren. El desarrollador de ~Conjugar~ ha tratado estas variantes como tiempos separados con diferentes nombres con fines pedagógicos.

^Conjugación^

En pluscuamperfecto de subjuntivo 2, se usa la conjugación del %imperfecto de subjuntivo 2% de ~haber~ como auxiliar, y es seguida por el %participio% del verbo que se conjuga.

Ejemplo: \"$hUbiese hablado$\" = \"I had $spOken$\"";

"futuroPerfectoDeSubjuntivoText" = "^Uso^

El ~futuro perfecto de subjuntivo~ expresa un acto incierto y futuro como terminado con relación a un evento futuro. Este tiempo ya no se usa en español, excepto en textos formales o legales.

\"Si para Navidad no $hUbiere vUELTo$, no me esperéis.\" = \"If he has not returned by Christmas, do not wait for me.\"

^Conjugación^

En futuro perfecto de subjuntivo se usa la conjugación del %futuro de subjuntivo% de ~haber~ como auxiliar, seguida del %participio% del verbo que se conjuga.

Ejemplo: \"$hUbiere hablado$\" = \"I would (or shall) have $spOken$\"

Ve a %créditos% para leer la atribución a la Word Reference.";

"questionsAndAnswersText" = "~P:~ ¿Cómo puedo contactar con el desarrollador de ~Conjugar~?

~R:~ Envíale un correo electrónico al desarrollador: vermontcoder@gmail.com

~P:~ Falta un verbo en la lista de ~Explorar~. ¿Por qué?

~R:~ El objetivo de ~Conjugar~ es enseñar la conjugación de los verbos españoles, no servir de diccionario. Si buscas un inventario de verbos completo, ~SpanishDict.com~ y ~Spanish Verbs Made Simple(r)~ son mejores opciones. Dicho esto, no dudes en enviarle un correo electrónico al desarrollador de ~Conjugar~ a vermontcoder@gmail.com si deseas que aparezca un verbo en concreto.

~P:~ ¿Por qué ~Conjugar~ usa nombres en español para los tiempos verbales en lugar de en inglés (por ejemplo, %presente de indicativo% en lugar de \"present indicative\")?

~R:~ Es cierto que los nombres verbales del inglés quizás sean más fáciles de entender para el alumno en ciertos casos, como por ejemplo, el de %raíz futura%. Los angloparlantes podrían entender mejor el término \"future stem\", pero quizás debido a sus años trabajando como abogado y desarrollador de software, el desarrollador de ~Conjugar~ valora la precisión en el lenguaje. Los nombres de los tiempos en inglés son imprecisos cuando se aplican a los tiempos en español. Por ejemplo, el \"gerund\" inglés puede actuar como un adjetivo, pero no el %gerundio% español. En ese sentido, el término \"gerund\" es inexacto cuando se emplea para referirse al %gerundio%. Lo mismo ocurre con otros nombres en inglés y otros tiempos del español, en diversos grados.

~P:~ He visto los términos \"modo\" y \"aspecto\" en las descripciones de los tiempos verbales, pero ~Conjugar~ no usa estos términos. Además, %participio%, %gerundio% y %raíz futura% no son realmente tiempos verbales.

~R:~ ¿Es una pregunta? Tienes razón. ~Conjugar~ no usa estos dos términos, y esas tres cosas normalmente no se describen como \"tiempos\". Sobre los nombres usados para nombrarlos, ten en cuenta que el propósito de ~Conjugar~ es enseñar las conjugaciones de los verbos del español, no enseñar los nombres de las conjugaciones de los verbos españoles en inglés. Y con respecto al participio, gerundio y raíz futura, el desarrollador de ~Conjugar~ considera que estas tres cosas son tiempos verbales, si se considera que \"tiempo\" significa \"una forma sistemática de cambiar verbos para un propósito específico\". Esta definición, aunque no es la habitual en los diccionarios, desde el humilde punto de vista del desarrollador de ~Conjugar~, contribuye bastante bien al propósito pedagógico de ~Conjugar~.

~P:~ ¿Cómo es que ~Conjugar~ es gratis?

~R:~ Los objetivos que tenía el desarrollador al crear ~Conjugar~ eran aprender la conjugación de los verbos del español y practicar diseño programático (una técnica de desarrollo de software), no ganarse la vida. Dicho esto, el dinero es útil, y el desarrollador añadirá un tarro de propinas o algún tipo de compra integrada en la aplicación si el número de descargas justifica el esfuerzo.";

"voseoText" = "^Antecedentes^

En ciertas partes de América Latina, cuando se dirigen a una persona de manera informal, los hispanohablantes usan el pronombre ~vos~ y sus conjugaciones en lugar del pronombre ~tú~ y sus conjugaciones. Este fenómeno, ~voseo~, aparece por toda Argentina y ocurre, en diversos grados, en toda América Latina, excepto en República Dominicana y Puerto Rico. Desafortunadamente, las conjugaciones de ~vos~ varían según el país y la región, lo que le complica las cosas al estudiante de español, pero la Real Academia Española (RAE), la principal autoridad del idioma español, proporciona unas conjugaciones modelo. Estas conjugaciones tienen algún valor porque un hispanohablante de Medellín, Colombia, le confirmó al desarrollador de ~Conjugar~ que las usa. Para una mayor conveniencia, ~Conjugar~ usa las conjugaciones ~vos~ de RAE.

^Conjugación^

Las conjugaciones de ~vos~ son muy parecidas a las de ~tú~ y, en menor medida, a las de ~vosotros~. En %presente de indicativo%, las terminaciones son -ás, -ís y -és para los verbos regulares terminados en AR, IR y ER, respectivamente. Ejemplos: hablás, subís, comés.

En %imperativo positivo%, las terminaciones son -á, -í y -é para los verbos regulares en AR, IR y ER, respectivamente. Ejemplos: hablá, subí, comé. Hay dos verbos irregulares de ~vos~ en %imperativo positivo%: ir ($ANDÁ$) y dar ($dA$).

En los siguientes tiempos, las terminaciones de ~vos~ son idénticas a las terminaciones de ~tú~: %pretérito%, %imperfecto de indicativo%, %futuro de indicativo%, %condicional%, %presente de subjuntivo%, %imperfecto de subjuntivo 1%, %imperfecto de subjuntivo 2%, %futuro de subjuntivo% e %imperativo negativo%.

Las conjugaciones de ~vos~ de los tiempos compuestos son idénticas a las formas correspondientes de ~tú~.

Hay ciertos verbos que cambian las vocales en las conjugaciones de ~yo~, ~tú~, ~él~ y ~ellos~, pero no en las conjugaciones de ~nosotros~ o ~vosotros~, que tampoco cambian las vocales en la conjugación de ~vos~. Ejemplos: Tú $mUEves$. Vos movés. Yo $pIerdo$. Vos perdés. Ella $pUEde$. Vos podés. En este sentido, las conjugaciones de ~vos~ son más regulares que las de ~yo~, ~tú~, ~él~ y ~ellos~.

Ve a %créditos% para leer la atribución a la Wikipedia y RAE.";

"creditsText" = "^Conjugar^

Josh Adams desarrolló ~Conjugar~ y lanzó su código fuente con la Licencia Pública General Affero de GNU, disponible en el siguente enlace: %https://github.com/vermont42/Conjugar/blob/master/LICENSE%

El código fuente de ~Conjugar~ vive aquí: %https://github.com/vermont42/Conjugar/%

^Wikipedia^

Las descripciones del %pretérito%, %futuro de indicativo%, %condicional%, %participio%, %gerundio%, %imperfecto de indicativo% , %futuro de subjuntivo%, %imperfecto de subjuntivo 1%, %imperfecto de subjuntivo 2% , %perfecto de indicativo%, %pluscuamperfecto de indicativo%, %futuro perfecto%, %pretérito anterior%, %condicional compuesto% y %perfecto de subjuntivo% se han tomado, en parte, del artículo de la Wikipedia sobre los verbos españoles, %https://en.wikipedia.org/wiki/Spanish_verbs%. La descripción de %voseo% se basa en el artículo de la Wikipedia sobre ~voseo~, %https://en.wikipedia.org/wiki/Voseo%, así como en las conjugaciones de la Real Academia Española, %http://www.rae.es%. Las modificaciones del contenido de la Wikipedia incluyen el formateo y los verbos irregulares añadidos como ejemplo, entre otros. Wikipedia ha publicado los contenidos de sus artículos con los verbos españoles y ~voseo~ con la licencia de \"Atribución-CompartirIgual 3.0 No portada (CC BY-SA 3.0)\", disponible en %https://creativecommons.org/licenses/by-sa/3.0/%. Todas las modificaciones del contenido de Wikipedia añadidas por el desarrollador de ~Conjugar~ tienen esa misma licencia, así como la licencia Affero.

^Word Reference^

La descripción y el ejemplo del %futuro perfecto de subjuntivo% provienen de una publicación del usuario kunvla del siguiente hilo de Word Reference: %https://forum.wordreference.com/threads/futuro-compuesto-subjuntivo.1375438/% Sobre la reutilización de este contenido, Word Reference establece lo siguiente: \"You are free to quote short passages or definitions from threads in the Forums outside the forums.\".

^Íconos / Iconos^

Christine Daughtry creó el ícono (icono) de la aplicación.

Borja Santos Lobo creó el ícono (icono) del bailarín y lo publicó con la licencia \"Atribución-CompartirIgual 3.0 No portada (CC BY-SA 3.0)\", disponible en %https://creativecommons.org/licenses/by-sa/3.0/%.

Saeful Muslim creó el ícono (icono) del toro y lo publicó con la licencia \"Atribución-CompartirIgual 3.0 No portada (CC BY-SA 3.0)\", disponible en %https://creativecommons.org/licenses/by-sa/3.0/%.

Mariela Peña creó los íconos (iconos) de los engranajes y de los signos de interrogación.

^Traducción^

Margarita Gracia revisó la traducción al español de Conjugar, aportó correcciones a las descripciones de los tiempos verbales y mejoró algunos ejemplos de sus usos.

Ferran Poveda llevó a cabo las correcciones de las traducciones al español.

^Sound Jay^

Sound Jay (%https://www.soundjay.com%) creó todos los sonidos de ~Conjugar~ y graciosamente \"allow[s] ... incorporat[ion of these sounds] into ... projects, be it for commercial or non-commercial use.\" Sound Jay \"and its licensors retain all ownership rights to the sound files\".

^Prueba de Unidad^

Dominik Hauser escribió un código que sirvió de inspiración para creer una de las técnicas de prueba de unidad que usa ~Conjugar~. Señor Hauser publicó este código que se encuentra disponible en %https://github.com/dasdom/TestingNavigationDemo% con la Licencia del MIT reproducida anteriormente.

^Letras Acentuadas^

Sheila Smith sugirió aclaraciones sobre cómo escribir letras acentuadas como ó.

^Vista Previa de la Aplicación^

La vista previa de la aplicación ~Conjugar~ usa la canción \"Arroz Con Pollo\" de Kevin MacLeod (incompetech.com). La atribución sigue.

Arroz Con Pollo by Kevin MacLeod
Link: %https://incompetech.filmmusic.io/song/3381-arroz-con-pollo%
License: %http://creativecommons.org/licenses/by/4.0/%";
"Models" = "Modelos";
"Irregularity" = "Irregularidad";
"Number" = "Número";
"Model %@ · %d%% irregular" = "Modelo %@ · %d%% irregular";
"%d verbs use this model" = "%d verbos usan este modelo";
"One verb uses this model" = "Un verbo usa este modelo";
